In [1]:
#we import libraries as necessary
import pandas as pd
import re
import src.cleaning as clean
import src.manipulating_df as man
import matplotlib.pyplot as plt
import numpy as np

### We open the first dataset about GHG emissions worldwide

In [18]:
emissions1 = pd.read_csv('input/worldwide_emission _data.csv',encoding='latin-1')
emissions1.head()

,Country,1751,1752,1753,1754,1755,1756,1757,1758,1759,...,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017
0,Afghanistan,0,0,0,0,0,0,0,0,0,...,8.515264e+07,9.191295e+07,1.003652e+08,1.125912e+08,1.233332e+08,1.333337e+08,1.431228e+08,1.532303e+08,1.654882e+08,1.785029e+08
1,Africa,0,0,0,0,0,0,0,0,0,...,3.183077e+10,3.301904e+10,3.421283e+10,3.541120e+10,3.664504e+10,3.789569e+10,3.918617e+10,4.047518e+10,4.178583e+10,4.311757e+10
2,Albania,0,0,0,0,0,0,0,0,0,...,2.287948e+08,2.331696e+08,2.377643e+08,2.430001e+08,2.479062e+08,2.529662e+08,2.586784e+08,2.646261e+08,2.708990e+08,2.772782e+08
3,Algeria,0,0,0,0,0,0,0,0,0,...,2.894820e+09,3.015005e+09,3.132819e+09,3.252626e+09,3.380736e+09,3.513171e+09,3.656348e+09,3.806940e+09,3.957319e+09,4.107870e+09
4,Americas (other),0,0,0,0,0,0,0,0,0,...,7.746025e+10,7.961787e+10,8.187178e+10,8.416656e+10,8.654197e+10,8.894874e+10,9.139192e+10,9.382747e+10,9.624253e+10,9.864116e+10

In [3]:
#we explore data i for further understanding
emissions1.shape

(231, 268)

In [16]:
emissions1.Country.unique()

array(['Afghanistan', 'Africa', 'Albania', 'Algeria', 'Americas (other)',
       'Andorra', 'Angola', 'Anguilla', 'Antarctic Fisheries',
       'Antigua and Barbuda', 'Argentina', 'Armenia', 'Aruba',
       'Asia and Pacific (other)', 'Australia', 'Austria', 'Azerbaijan',
       'Bahamas', 'Bahrain', 'Bangladesh', 'Barbados', 'Belarus',
       'Belgium', 'Belize', 'Benin', 'Bermuda', 'Bhutan', 'Bolivia',
       'Bonaire Sint Eustatius and Saba', 'Bosnia and Herzegovina',
       'Botswana', 'Brazil', 'British Virgin Islands', 'Brunei',
       'Bulgaria', 'Burkina Faso', 'Burundi', 'Cambodia', 'Cameroon',
       'Canada', 'Cape Verde', 'Cayman Islands',
       'Central African Republic', 'Chad', 'Chile', 'China',
       'Christmas Island', 'Colombia', 'Comoros', 'Congo', 'Cook Islands',
       'Costa Rica', "Cote d'Ivoire", 'Croatia', 'Cuba', 'Curacao',
       'Cyprus', 'Czech Republic', 'Czechoslovakia',
       'Democratic Republic of Congo', 'Denmark', 'Djibouti', 'Dominica',
       'Dominican Republic', 'EU-28', 'Ecuador', 'Egypt', 'El Salvador',
       'Equatorial Guinea', 'Eritrea', 'Estonia', 'Ethiopia',
       'Europe (other)', 'Faeroe Islands', 'Falkland Islands', 'Fiji',
       'Finland', 'France', 'French Guiana', 'French Polynesia', 'Gabon',
       'Gambia', 'Georgia', 'Germany', 'Ghana', 'Gibraltar', 'Greece',
       'Greenland', 'Grenada', 'Guadeloupe', 'Guatemala', 'Guinea',
       'Guinea-Bissau', 'Guyana', 'Haiti', 'Honduras', 'Hong Kong',
       'Hungary', 'Iceland', 'India', 'Indonesia', 'Iran', 'Iraq',
       'Ireland', 'Israel', 'Italy', 'Jamaica', 'Japan', 'Jordan',
       'Kazakhstan', 'Kenya', 'Kiribati', 'Kuwait', 'Kyrgysztan',
       'Kyrgyzstan', 'Laos', 'Latvia', 'Lebanon', 'Lesotho', 'Liberia',
       'Libya', 'Liechtenstein', 'Lithuania', 'Luxembourg', 'Macao',
       'Macedonia', 'Madagascar', 'Malawi', 'Malaysia', 'Maldives',
       'Mali', 'Malta', 'Marshall Islands', 'Martinique', 'Mauritania',
       'Mauritius', 'Mexico', 'Micronesia (country)', 'Middle East',
       'Moldova', 'Mongolia', 'Montenegro', 'Montserrat', 'Morocco',
       'Mozambique', 'Myanmar', 'Namibia', 'Nauru', 'Nepal',
       'Netherlands', 'New Caledonia', 'New Zealand', 'Nicaragua',
       'Niger', 'Nigeria', 'Niue', 'North Korea', 'Norway', 'Oman',
       'Pakistan', 'Palau', 'Palestine', 'Panama', 'Papua New Guinea',
       'Paraguay', 'Peru', 'Philippines', 'Poland', 'Portugal', 'Qatar',
       'Reunion', 'Romania', 'Russia', 'Rwanda', 'Saint Helena',
       'Saint Kitts and Nevis', 'Saint Lucia',
       'Saint Pierre and Miquelon', 'Saint Vincent and the Grenadines',
       'Samoa', 'Sao Tome and Principe', 'Saudi Arabia', 'Senegal',
       'Serbia', 'Seychelles', 'Sierra Leone', 'Singapore',
       'Sint Maarten (Dutch part)', 'Slovakia', 'Slovenia',
       'Solomon Islands', 'Somalia', 'South Africa', 'South Korea',
       'South Sudan', 'Spain', 'Sri Lanka', 'Sudan', 'Suriname',
       'Swaziland', 'Sweden', 'Switzerland', 'Syria', 'Taiwan',
       'Tajikistan', 'Tanzania', 'Thailand', 'Timor', 'Togo', 'Tonga',
       'Trinidad and Tobago', 'Tunisia', 'Turkey', 'Turkmenistan',
       'Turks and Caicos Islands', 'Tuvalu', 'Uganda', 'Ukraine',
       'United Arab Emirates', 'United Kingdom', 'United States',
       'Uruguay', 'Uzbekistan', 'Vanuatu', 'Venezuela', 'Vietnam',
       'Wallis and Futuna Islands', 'World', 'Yemen', 'Zambia',
       'Zimbabwe'], dtype=object)

In [4]:
##we want to see the evolution of the emissions worldwide though time
world_emissions=emissions1[emissions1['Country']=='World'].T
world_emissions=world_emissions.reset_index()
world_emissions.columns=['Year','CO2_Tonnes']
world_emissions=world_emissions.drop(axis=0,index=0)
world_emissions.head()

   Year CO2_Tonnes
1  1751    9350528
2  1752   18704720
3  1753   28058912
4  1754   37416768
5  1755   46778288

In [5]:
world_emissions['CO2_emissions']=world_emissions['CO2_Tonnes'].map(lambda x:(x/1e10))
clean.rounding(world_emissions)
world_emissions=world_emissions[['Year','CO2_emissions']]
world_emissions.head()

   Year  CO2_emissions
1  1751            0.0
2  1752            0.0
3  1753            0.0
4  1754            0.0
5  1755            0.0

In [6]:
##we save our desired df as cvs file so as to open it in another jupyter-notebook
man.export_cvs(world_emissions)

Please, enter the name for the cvs file you want to exportworld_emissions

'world_emissions has been exported to cvs file'

### We open the second dataset about vehicles' emissions

In [2]:
vehicles = man.open_cvs()
vehicles.head()
##CO2_vehicles_Emissions_Canada is the file in input folder

Please, enter the folder where your cvs file is saved:
input
Please, enter the name for the cvs file you want to open without extension:
registered_vehicles

               Country   Year Data Source Number of registered vehicles
0          Afghanistan   2013      RS_001                       655 357
1              Albania   2016      RS_002                       563 106
2  Antigua and Barbuda   2016      RS_003                        36 030
3            Argentina   2016      RS_004                    21 633 587
4              Armenia                                              NaN

In [3]:
#we explore data i for further understanding
vehicles.shape

(163, 4)

In [4]:
#we will rename columns removing blank spaces to avoid  problems in future by calling a function from the
# file columns.py
clean.rename_columns(vehicles)
vehicles.head()

               Country   Year Data_Source Number_of_registered_vehicles
0          Afghanistan   2013      RS_001                       655 357
1              Albania   2016      RS_002                       563 106
2  Antigua and Barbuda   2016      RS_003                        36 030
3            Argentina   2016      RS_004                    21 633 587
4              Armenia                                              NaN

In [5]:
vehicles['Vehicle_Class'].unique()

KeyError: 'Vehicle_Class'

In [6]:
vehicles['Fuel_Type'].unique()

array(['Z', 'D', 'X', 'E', 'N'], dtype=object)

### We open the last dataset, about registered vehicles in the world

In [124]:
register = man.open_cvs()
register.head()

##registered_vehicles is the file in input folder

Please, enter the folder where your cvs file is saved:
input
Please, enter the name for the cvs file you want to open without extension:
registered_vehicles

               Country   Year Data Source Number of registered vehicles
0          Afghanistan   2013      RS_001                       655 357
1              Albania   2016      RS_002                       563 106
2  Antigua and Barbuda   2016      RS_003                        36 030
3            Argentina   2016      RS_004                    21 633 587
4              Armenia                                              NaN

In [125]:
#we will rename columns removing blank spaces to avoid  problems in future by calling a function from the
# file columns.py
clean.rename_columns(register)
register.head()

               Country   Year Data_Source Number_of_registered_vehicles
0          Afghanistan   2013      RS_001                       655 357
1              Albania   2016      RS_002                       563 106
2  Antigua and Barbuda   2016      RS_003                        36 030
3            Argentina   2016      RS_004                    21 633 587
4              Armenia                                              NaN

In [126]:
register.isnull().sum()

Country                          0
Year                             0
Data_Source                      0
Number_of_registered_vehicles    1
dtype: int64

In [127]:
#We will drop Armenia as is the only country with no records 
register=register.dropna(0)
register=register[['Country','Year','Number_of_registered_vehicles']]
register.head()

               Country   Year Number_of_registered_vehicles
0          Afghanistan   2013                       655 357
1              Albania   2016                       563 106
2  Antigua and Barbuda   2016                        36 030
3            Argentina   2016                    21 633 587
5            Australia   2016                    18 326 236

In [128]:
##As we can see, the number of registered vehicles is a string type column.We will strip blank spaces and convert
##those values into integers
clean.white_spaces(register,'Number_of_registered_vehicles').head()
clean.convert_integer(register,'Number_of_registered_vehicles').head()

               Country   Year  Number_of_registered_vehicles
0          Afghanistan   2013                         655357
1              Albania   2016                         563106
2  Antigua and Barbuda   2016                          36030
3            Argentina   2016                       21633587
5            Australia   2016                       18326236

In [129]:
clean.white_spaces(register,'Year').head()

               Country  Year  Number_of_registered_vehicles
0          Afghanistan  2013                         655357
1              Albania  2016                         563106
2  Antigua and Barbuda  2016                          36030
3            Argentina  2016                       21633587
5            Australia  2016                       18326236

In [134]:
register=register[register.Year.isin(['2017','2016','2016-2017'])]

In [135]:
register_years=register.groupby('Year').agg({'Number_of_registered_vehicles':'sum'})
register_years=register_years.sort_values(by='Year',ascending=False).reset_index()
register_years

        Year  Number_of_registered_vehicles
0       2017                       27123655
1  2016-2017                       30380771
2       2016                     1236779436

In [136]:
##we save our desired df as cvs file so as to open it in another jupyter-notebook
man.export_cvs(register)

Please, enter the name for the cvs file you want to exportregister

'register has been exported to cvs file'